Repository: mohaneddz/Chef-Kit
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Chef Kit
ar: شيف كيت

source: Discover Recipes
ar: اكتشف الوصفات

source: Find your next favorite meal
ar: اعثر على وجبتك المفضلة التالية

source: Search Recipes or Chefs
ar: ابحث عن وصفات أو طهاة

source: Chefs
ar: الطهاة

source: Hot Recipes
ar: وصفات ساخنة

source: Seasonal Delights
ar: المسرات الموسمية

source: See all
ar: عرض الكل

# servings
source: {count} servings
ar: {count} حصص

# calories
source: {count} Kcal
ar: {count} سعرة حرارية

# recipeDetailsFor
source: Recipe details for {name}
ar: تفاصيل الوصفة لـ {name}

# minutes
source: {count} min
ar: {count} دقيقة

# error
source: Error: {message}
ar: خطأ: {message}

source: All Chefs
ar: كل الطهاة

source: Super Hot
ar: رائج جداً

source: Total
ar: المجموع

source: Super Hot Chefs
ar: طهاة رائجون جداً

# trendingChefsSubtitle
source: The most trending chefs right now
ar: أكثر الطهاة رواجاً الآن

# paginationInfo
source: Page {currentPage} of {totalPages} â€¢ {chefCount} chefs
ar: صفحة {currentPage} من {totalPages} • {chefCount} طهاة

# recipesStat
source: recipes
ar: وصفات

# trendingStat
source: trending
ar: رائج

# favoritesStat
source: favorites
ar: المفضلة

# filterAll
source: All
ar: الكل

# filterTrending
source: Trending
ar: رائج

# filterTraditional
source: Traditional
ar: تقليدي

# filterSoup
source: Soup
ar: حساء

# filterQuick
source: Quick
ar: سريع

# hotBadge
source: HOT
ar: ساخن

# seasonalDelightsTitle
source: Seasonal Delights
ar: المسرات الموسمية

source: Fresh This Season
ar: طازج هذا الموسم

# seasonalDescription
source: Discover recipes perfect for the current season
ar: اكتشف وصفات مثالية للموسم الحالي

# seasonSpring
source: Spring
ar: الربيع

# seasonSummer
source: Summer
ar: الصيف

# seasonAutumn
source: Autumn
ar: الخريف

# seasonWinter
source: Winter
ar: الشتاء

# seasonalRecipesCount
source: {count} {season} recipes
ar: {count} وصفات {season}

# notificationsTitle
source: Notifications
ar: الإشعارات

source: Mark all read
ar: تحديد الكل كمقروء

# noNotifications
source: No notifications yet
ar: لا توجد إشعارات بعد

# notificationNewRecipeTitle
source: New Recipe Posted!
ar: تم نشر وصفة جديدة!

# notificationNewRecipeMessage
source: Chef Gordon posted a new Beef Wellington recipe
ar: نشر الشيف جوردون وصفة بيف ويلينغتون جديدة

# notificationRecipeLikedTitle
source: Recipe Liked
ar: تم الإعجاب بالوصفة

# notificationRecipeLikedMessage
source: Sarah liked your Mahjouba recipe
ar: أعجبت سارة بوصفة المحجوبة الخاصة بك

# notificationNewFollowerTitle
source: New Follower
ar: متابع جديد

# notificationNewFollowerMessage
source: Chef Jamie started following you
ar: بدأ الشيف جيمي بمتابعتك

# notificationCommentTitle
source: Comment on Recipe
ar: تعليق على الوصفة

# notificationCommentMessage
source: Mike commented on your Couscous recipe: "Looks delicious!"
ar: علق مايك على وصفة الكسكس الخاصة بك: "تبدو لذيذة!"

# notificationChallengeTitle
source: Weekly Challenge
ar: التحدي الأسبوعي

# notificationChallengeMessage
source: New weekly cooking challenge is now available!
ar: تحدي الطهي الأسبوعي الجديد متاح الآن!

# notificationSavedTitle
source: Recipe Saved
ar: تم حفظ الوصفة

# notificationSavedMessage
source: Your Tajine recipe was saved by 15 people this week
ar: تم حفظ وصفة الطاجين الخاصة بك من قبل 15 شخصًا هذا الأسبوع

# notificationTrendingTitle
source: Trending Recipe
ar: وصفة رائجة

# notificationTrendingMessage
source: Your Chorba recipe is trending! ðŸ”¥
ar: وصفة الشوربة الخاصة بك رائجة! 🔥

# notificationAchievementTitle
source: New Achievement
ar: إنجاز جديد

# notificationAchievementMessage
source: Congratulations! You unlocked "Master Chef" badge
ar: مبروك! لقد فتحت شارة "ماستر شيف"

# notificationRecipeDayTitle
source: Recipe of the Day
ar: وصفة اليوم

# notificationRecipeDayMessage
source: Your Barkoukes was featured as Recipe of the Day!
ar: تم عرض البركوكس الخاص بك كوصفة اليوم!

# notificationIngredientTitle
source: Ingredient Alert
ar: تنبيه المكونات

# notificationIngredientMessage
source: Paprika is running low in your inventory
ar: البابريكا تنفد من مخزونك

# timeMinAgo
source: {count} min ago
ar: منذ {count} دقيقة

# timeHourAgo
source: {count} hour ago
ar: منذ {count} ساعة

# timeHoursAgo
source: {count} hours ago
ar: منذ {count} ساعات

# timeDayAgo
source: {count} day ago
ar: منذ {count} يوم

# timeDaysAgo
source: {count} days ago
ar: منذ {count} أيام

# inventoryTitle
source: My Kitchen Inventory
ar: مخزون مطبخي

# inventorySubtitle
source: Manage your ingredients
ar: إدارة المكونات الخاصة بك

# availableIngredientsTitle
source: Available Ingredients
ar: المكونات المتاحة

# availableIngredientsSubtitle
source: Your current pantry items
ar: عناصر المؤن الحالية الخاصة بك

# availableCount
source: {count} Available
ar: {count} متاح

# totalItemsCount
source: {count} Total Items
ar: {count} إجمالي العناصر

source: Show less
ar: عرض أقل

source: Show more
ar: عرض المزيد

# browseIngredientsTitle
source: Browse all the ingredients
ar: تصفح جميع المكونات

# browseIngredientsSubtitle
source: Find what you need?
ar: هل تجد ما تحتاجه؟

# ingredientTypeAll
source: All
ar: الكل

# ingredientTypeProtein
source: Protein
ar: بروتين

# ingredientTypeVegetables
source: Vegetables
ar: خضروات

# ingredientTypeSpices
source: Spices
ar: توابل

# ingredientTypeFruits
source: Fruits
ar: فواكه

# favouritesTitle
source: Favourites
ar: المفضلة

# favouritesSubtitle
source: Find Your Saved Recipes
ar: اعثر على وصفاتك المحفوظة

source: No Favourites Yet
ar: لا توجد مفضلات بعد

# noFavouritesMessage
source: Explore the app and save your favourite recipes!
ar: استكشف التطبيق واحفظ وصفاتك المفضلة!

source: Search Your Recipes...
ar: ابحث في وصفاتك...

# categoriesTitle
source: Categories
ar: الفئات

source: Search ingredient...
ar: ابحث عن مكون...

# profileTitle
source: Profile
ar: الملف الشخصي

source: Not logged in
ar: غير مسجل الدخول

source: Go to Login
ar: الذهاب لتسجيل الدخول

source: Error loading profile
ar: خطأ في تحميل الملف الشخصي

source: Retry
ar: إعادة المحاولة

source: No profile data
ar: لا توجد بيانات للملف الشخصي

# recipesCount
source: Recipes
ar: الوصفات

# followingCount
source: Following
ar: أتابع

# followersCount
source: Followers
ar: المتابعون

source: Chef's Corner
ar: ركن الشيف

source: My Recipes
ar: وصفاتي

source: General
ar: عام

source: Personal Info
ar: المعلومات الشخصية

source: Security
ar: الأمان

source: Preferences
ar: التفضيلات

source: Language
ar: اللغة

source: Dark Mode
ar: الوضع الداكن

source: Log Out
ar: تسجيل الخروج

source: English
ar: الإنجليزية

source: French
ar: الفرنسية

source: Arabic
ar: العربية

# securityTitle
source: Security
ar: الأمان

source: Account Security
ar: أمان الحساب

# accountSecuritySubtitle
source: Manage how you sign in and keep your account protected.
ar: إدارة كيفية تسجيل الدخول والحفاظ على حماية حسابك.

source: Change email
ar: تغيير البريد الإلكتروني

# changeEmailSubtitle
source: We will send a six-digit code to your new address to confirm the switch.
ar: سنرسل رمزًا مكونًا من ستة أرقام إلى عنوانك الجديد لتأكيد التغيير.

source: New email address
ar: عنوان البريد الإلكتروني الجديد

source: Enter OTP
ar: أدخل رمز التحقق

source: Send code
ar: إرسال الرمز

source: Confirm change
ar: تأكيد التغيير

source: Edit email input
ar: تعديل البريد الإلكتروني

source: Update password
ar: تحديث كلمة المرور

# updatePasswordSubtitle
source: Your password must include at least eight characters. We will confirm with a code sent to your inbox.
ar: يجب أن تتضمن كلمة المرور الخاصة بك ثمانية أحرف على الأقل. سنؤكد ذلك برمز يتم إرساله إلى صندوق الوارد الخاص بك.

source: Current password
ar: كلمة المرور الحالية

source: New password
ar: كلمة المرور الجديدة

# passwordHelperText
source: Use at least 8 characters
ar: استخدم 8 أحرف على الأقل

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

source: Edit password inputs
ar: تعديل كلمة المرور

source: No email on file
ar: لا يوجد بريد إلكتروني مسجل

# enterNewEmail
source: Please enter a new email address.
ar: الرجاء إدخال عنوان بريد إلكتروني جديد.

# enterValidEmail
source: Enter a valid email address.
ar: أدخل عنوان بريد إلكتروني صالح.

# emailMatchesCurrent
source: New email matches your current email.
ar: البريد الإلكتروني الجديد يطابق بريدك الإلكتروني الحالي.

# otpSentTo
source: OTP sent to {email}. Check your inbox to continue.
ar: تم إرسال رمز التحقق إلى {email}. تحقق من صندوق الوارد للمتابعة.

# enterOtpSent
source: Enter the OTP code sent to your new email.
ar: أدخل رمز التحقق المرسل إلى بريدك الإلكتروني الجديد.

# otpLengthError
source: OTP codes are 6 digits.
ar: رموز التحقق تتكون من 6 أرقام.

# emailUpdatedSuccess
source: Email updated successfully.
ar: تم تحديث البريد الإلكتروني بنجاح.

# completePasswordFields
source: Complete all password fields.
ar: أكمل جميع حقول كلمة المرور.

# passwordLengthError
source: Use at least 8 characters for your new password.
ar: استخدم 8 أحرف على الأقل لكلمة المرور الجديدة.

# passwordsDoNotMatch
source: New password and confirmation do not match.
ar: كلمة المرور الجديدة والتأكيد غير متطابقين.

# passwordMustDiffer
source: New password must differ from the current password.
ar: يجب أن تختلف كلمة المرور الجديدة عن كلمة المرور الحالية.

# otpSentEmail
source: OTP sent to your email. Enter it to confirm the password update.
ar: تم إرسال رمز التحقق إلى بريدك الإلكتروني. أدخله لتأكيد تحديث كلمة المرور.

# provideOtpAndPassword
source: Provide both the OTP code and new password.
ar: قدم كلاً من رمز التحقق وكلمة المرور الجديدة.

# passwordUpdatedSuccess
source: Password updated successfully. Use your new password next time you sign in.
ar: تم تحديث كلمة المرور بنجاح. استخدم كلمة المرور الجديدة في المرة القادمة التي تقوم فيها بتسجيل الدخول.

source: Something went wrong.
ar: حدث خطأ ما.

# navDiscovery
source: Discovery
ar: اكتشاف

# navInventory
source: Inventory
ar: المخزون

# navFavorite
source: Favorite
ar: المفضلة

# navProfile
source: Profile
ar: الملف الشخصي

source: All Saved
ar: كل المحفوظات

# recipeSingular
source: recipe
ar: وصفة

# recipePlural
source: recipes
ar: وصفات

# loadingAnalyzing
source: Analyzing your ingredients...
ar: تحليل مكوناتك...

# loadingSearching
source: Searching recipes...
ar: البحث عن وصفات...

# loadingMatching
source: Matching...
ar: مطابقة...

# loadingFinding
source: Finding perfect recipes...
ar: إيجاد الوصفات المثالية...

source: Finding Recipes
ar: البحث عن وصفات

# recipeResultsTitle
source: Recipe Results
ar: نتائج الوصفات

# recipesFound
source: {count, plural, =0{No recipes found} =1{1 recipe found} other{{count} recipes found}}
ar: {count, plural, =0{لم يتم العثور على وصفات} =1{تم العثور على وصفة واحدة} =2{تم العثور على وصفتين} other{تم العثور على {count} وصفات}}

source: Your Ingredients:
ar: مكوناتك:

source: Recipes You Can Make
ar: وصفات يمكنك صنعها

# sortedByMatch
source: Sorted by ingredient match
ar: مرتبة حسب تطابق المكونات

# caloriesLabel
source: Calories
ar: سعرات

# servingsLabel
source: Servings
ar: حصص

source: Ingredients
ar: المكونات

# itemsCount
source: {count} items
ar: {count} عناصر

source: Instructions
ar: التعليمات

# stepsCount
source: {count} steps
ar: {count} خطوات
